NetologySlow/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыИУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

NetologySlow/src/AccumulationRegisters/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Товары</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

NetologySlow/src/AccumulationRegisters/Расходы/Расходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Расходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

NetologySlow/src/AccountingRegisters/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Управленческий</name>
  <chartOfAccounts>ChartOfAccounts.Управленческий</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Управленческий.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
</mdclass:AccountingRegister>

NetologySlow/src/AccumulationRegisters/Доходы/Доходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Доходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаСНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

NetologySlow/src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами/ВзаиморасчетыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКонтрагентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

NetologySlow/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

NetologySlow/src/ChartsOfAccounts/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Управленческий</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41. </code>
    </items>
    <items>
      <name>ДенежныеСредства</name>
      <description>Денежные средства</description>
      <code>50. </code>
    </items>
    <items>
      <name>РассчетыСПоставщиками</name>
      <description>Рассчеты с поставщиками</description>
      <code>60. </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РассчетыСПокупателями</name>
      <description>Рассчеты с покупателями</description>
      <code>62. </code>
    </items>
    <items>
      <name>РассчетыССотрудниками</name>
      <description>Рассчеты с сотрудниками</description>
      <code>70. </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>Продажи</name>
      <description>Продажи</description>
      <code>90. </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Выручка</name>
        <description>Выручка</description>
        <code>90.1</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Расходы</name>
        <description>Расходы</description>
        <code>90.2</code>
      </childItems>
    </items>
  </predefined>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

NetologySlow/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Сотрудники</types>
    <types>CatalogRef.Контрагенты</types>
  </type>
  <predefined>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Сотрудники</name>
      <description>Сотрудники</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

NetologySlow/src/Documents/РеализацияТоваровИУслуг/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)  
	
	Ответственный=ПараметрыСеанса.ТекущийСотрудник;
	
КонецПроцедуры


// У вас есть СУММА по СуммеСНДС, но нет по СуммеНДС.
//Поля в запросе должны быть разделены на Агрегируемые и Группировочные. Группировочные в этой задаче номенклатура и ее тип, соответственно у остальных должна быть установлена агрегатная функция (СУММА).

Процедура ОбработкаПроведения(Отказ, Режим)    
	
	Движения.Товары.Очистить();
	Движения.Товары.Записывать = Истина;    
	Движения.Расходы.Очистить();
	Движения.Расходы.Записывать = Истина;     
	Движения.Управленческий.Очистить(); 
	Движения.Записать();  
	
	// регистр Управленческий   
	//Дт62 Расч. с покупателями - Кт90.1 Выручка
	Проводка=Движения.Управленческий.Добавить(); 
	Проводка.Период=Дата; 
	Проводка.СчетДт=ПланыСчетов.Управленческий.РассчетыСПокупателями; 
	Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты]
	=Покупатель; 
	Проводка.СчетКт=ПланыСчетов.Управленческий.Выручка;  
	Проводка.Сумма=ТоварыИУслуги.Итог("СуммаСНДС");
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	РеализацияТоваровИУслугТовары.Номенклатура КАК Номенклатура,
	|	СУММА(РеализацияТоваровИУслугТовары.Количество) КАК Количество,
	|	РеализацияТоваровИУслугТовары.Номенклатура.Тип КАК Тип,
	|	СУММА(РеализацияТоваровИУслугТовары.Сумма) КАК Сумма,
	|	СУММА(РеализацияТоваровИУслугТовары.СуммаСНДС) КАК СуммаСНДС,
	|	СУММА(РеализацияТоваровИУслугТовары.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.ТоварыИУслуги КАК РеализацияТоваровИУслугТовары
	|ГДЕ
	|	РеализацияТоваровИУслугТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровИУслугТовары.Номенклатура,
	|	РеализацияТоваровИУслугТовары.Номенклатура.Тип
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТовары.Номенклатура КАК Номенклатура,
	|	ВТТовары.Количество КАК Количество,
	|	ЕСТЬNULL(ТоварыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ТоварыОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ВТТовары.Номенклатура.Представление КАК НоменклатураПредставление,
	|	ВТТовары.Сумма КАК Сумма,
	|	ВТТовары.СуммаСНДС КАК СуммаСНДС,
	|	ВТТовары.СуммаНДС КАК СуммаНДС,
	|	ВТТовары.Тип КАК Тип,
	|	ЕСТЬNULL(УправленческийОстатки.СуммаОстаток, 0) КАК СуммаОстатокБух,
	|	ЕСТЬNULL(УправленческийОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокБух
	|ИЗ
	|	ВТТовары КАК ВТТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Товары.Остатки КАК ТоварыОстатки
	|		ПО ВТТовары.Номенклатура = ТоварыОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(
	|				&ДатаДокумента,
	|				Счет = &Номенклатура,
	|				,
	|				Субконто1 В
	|					(ВЫБРАТЬ
	|						ВТТовары.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ВТТовары КАК ВТТовары)) КАК УправленческийОстатки
	|		ПО ВТТовары.Номенклатура = УправленческийОстатки.Субконто1");  
	
	Запрос.УстановитьПараметр("ДатаДокумента", Новый Граница(МоментВремени(), ВидГраницы.Включая)); 
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	Результат=Запрос.Выполнить(); 
	Выборка=Результат.Выбрать();  
	
	Движения.Управленческий.Записывать=Истина; 
	Движения.Товары.Записывать = Истина; 
	Движения.Расходы.Записывать = Истина;  
	Движения.Доходы.Записывать = Истина;  
	
	Пока Выборка.Следующий() Цикл   
		Если Выборка.Тип = Перечисления.ТипыНоменклатуры.Товар Тогда   //В регистры Товары, Расходы, Доходы заносим всю номенклатуру с типом Товар
			Если Выборка.Количество > Выборка.КоличествоОстаток Тогда 
				Недостаточно=Выборка.Количество-Выборка.КоличествоОстаток; 
				Сообщить(СтрШаблон("Не хватает товара %1 на складе в количестве %2 шт.",Выборка.НоменклатураПредставление, Недостаточно)); 
				Отказ=Истина;
			ИначеЕсли  Выборка.Количество = Выборка.КоличествоОстаток Тогда   
				Себестоимость=Выборка.СуммаОстаток+Выборка.СуммаНДС; 
			Иначе
				Себестоимость=Выборка.СуммаОстаток / Выборка.КоличествоОстаток * Выборка.Количество+Выборка.СуммаНДС; 
			КонецЕсли; 
			
			/// регистр Товары Расход    
			//Движения.Товары.Записывать = Истина;
			Движение = Движения.Товары.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Количество = Выборка.Количество;
			Движение.Сумма = Себестоимость;  
			
			// регистр Расходы   
			Движение = Движения.Расходы.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Количество = Выборка.Количество;
			Движение.Сумма = Себестоимость;   
			
			//Движения Управленческий Дт 90.2 Расходы - Кт41 Товары
			Проводка=Движения.Управленческий.Добавить(); 
			Проводка.Период=Дата; 
			Проводка.СчетДт=ПланыСчетов.Управленческий.Расходы;   
			Проводка.СчетКт=ПланыСчетов.Управленческий.Товары; 
			Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура]
			=Выборка.Номенклатура; 
			Проводка.Сумма=Себестоимость;  
			Проводка.Количество=Выборка.Количество; 
			
			
		КонецЕсли; 	
		// регистр Доходы 
		Движение = Движения.Доходы.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Количество = Выборка.Количество;
		Движение.Сумма = Выборка.Сумма;
		Движение.СуммаСНДС = Выборка.СуммаСНДС;
		
	КонецЦикла;
	
	// регистр ВзаиморасчетыСКонтрагентами Приход
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Контрагент = Покупатель;
	Движение.Сумма = Сумма;       
	
	
	
КонецПроцедуры   

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//сохранять в реквизит шапки Сумма итог по одноименному реквизиту табличной части для отображения в списках
	Сумма = ТоварыИУслуги.Итог("СуммаСНДС");   
	//Если ЭтотОбъект.Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда   
	//	Сообщить ("Во избежание недоразумений, перед повторным проведением вначале распроведите документ"); 
	//	Отказ=Истина
	//КонецЕсли;
КонецПроцедуры
